CSI API ETABS v1

# cCaseResponseSpectrumGetDampConstant Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDampConstant(
    	string Name,
    	ref double Damp
    )

    Function GetDampConstant (
    	Name As String,
    	ByRef Damp As Double
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim Damp As Double
    Dim returnValue As Integer

    returnValue = instance.GetDampConstant(Name,
    	Damp)

    int GetDampConstant(
    	String^ Name,
    	double% Damp
    )

    abstract GetDampConstant :
            Name : string *
            Damp : float byref -> int

#### Parameters

Name

    Type: SystemString

Damp

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com